[
  {
    "text": "“The world as we have created it is a process of our thinking. It cannot be changed without changing our thinking.”",
    "author": "Albert Einstein",
    "tags": [
      "change",
      "deep-thoughts",
      "thinking",
      "world"
    ]
  },
  {
    "text": "“It is our choices, Harry, that show what we truly are, far more than our abilities.”",
    "author": "J.K. Rowling",
    "tags": [
      "abilities",
      "choices"
    ]
  },
  {
    "text": "“There are only two ways to live your life. One is as though nothing is a miracle. The other is as though everything is a miracle.”",
    "author": "Albert Einstein",
    "tags": [
      "inspirational",
      "life",
      "live",
      "miracle",
      "miracles"
    ]
  },
  {
    "text": "“The person, be it gentleman or lady, who has not pleasure in a good novel, must be intolerably stupid.”",
    "author": "Jane Austen",
    "tags": [
      "aliteracy",
      "books",
      "classic",
      "humor"
    ]
  },
  {
    "text": "“Imperfection is beauty, madness is genius and it's better to be absolutely ridiculous than absolutely boring.”",
    "author": "Marilyn Monroe",
    "tags": [
      "be-yourself",
      "inspirational"
    ]
  },
  {
    "text": "“Try not to become a man of success. Rather become a man of value.”",
    "author": "Albert Einstein",
    "tags": [
      "adulthood",
      "success",
      "value"
    ]
  },
  {
    "text": "“It is better to be hated for what you are than to be loved for what you are not.”",
    "author": "André Gide",
    "tags": [
      "life",
      "love"
    ]
  },
  {
    "text": "“I have not failed. I've just found 10,000 ways that won't work.”",
    "author": "Thomas A. Edison",
    "tags": [
      "edison",
      "failure",
      "inspirational",
      "paraphrased"
    ]
  },
  {
    "text": "“A woman is like a tea bag; you never know how strong it is until it's in hot water.”",
    "author": "Eleanor Roosevelt",
    "tags": [
      "misattributed-eleanor-roosevelt"
    ]
  },
  {
    "text": "“A day without sunshine is like, you know, night.”",
    "author": "Steve Martin",
    "tags": [
      "humor",
      "obvious",
      "simile"
    ]
  },
  {
    "text": "“I love you without knowing how, or when, or from where. I love you simply, without problems or pride: I love you in this way because I do not know any other way of loving but this, in which there is no I or you, so intimate that your hand upon my chest is my hand, so intimate that when I fall asleep your eyes close.”",
    "author": "Pablo Neruda",
    "tags": [
      "love",
      "poetry"
    ]
  },
  {
    "text": "“For every minute you are angry you lose sixty seconds of happiness.”",
    "author": "Ralph Waldo Emerson",
    "tags": [
      "happiness"
    ]
  },
  {
    "text": "“If you judge people, you have no time to love them.”",
    "author": "Mother Teresa",
    "tags": [
      "attributed-no-source"
    ]
  },
  {
    "text": "“Anyone who thinks sitting in church can make you a Christian must also think that sitting in a garage can make you a car.”",
    "author": "Garrison Keillor",
    "tags": [
      "humor",
      "religion"
    ]
  },
  {
    "text": "“Beauty is in the eye of the beholder and it may be necessary from time to time to give a stupid or misinformed beholder a black eye.”",
    "author": "Jim Henson",
    "tags": [
      "humor"
    ]
  },
  {
    "text": "“Today you are You, that is truer than true. There is no one alive who is Youer than You.”",
    "author": "Dr. Seuss",
    "tags": [
      "comedy",
      "life",
      "yourself"
    ]
  },
  {
    "text": "“If you want your children to be intelligent, read them fairy tales. If you want them to be more intelligent, read them more fairy tales.”",
    "author": "Albert Einstein",
    "tags": [
      "children",
      "fairy-tales"
    ]
  },
  {
    "text": "“It is impossible to live without failing at something, unless you live so cautiously that you might as well not have lived at all - in which case, you fail by default.”",
    "author": "J.K. Rowling",
    "tags": []
  },
  {
    "text": "“Logic will get you from A to Z; imagination will get you everywhere.”",
    "author": "Albert Einstein",
    "tags": [
      "imagination"
    ]
  },
  {
    "text": "“One good thing about music, when it hits you, you feel no pain.”",
    "author": "Bob Marley",
    "tags": [
      "music"
    ]
  }
]